IDEA StatiCa Open Model
MatAnchorProperties Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Anchor custom data
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Material.MatAnchorProperties
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MatAnchorProperties
Public Class MatAnchorProperties
public ref class MatAnchorProperties
The MatAnchorProperties type exposes the following members.
Constructors
Name | Description
MatAnchorProperties
Initializes a new instance of the MatAnchorProperties class
Top
Properties
Name | Description
FLS
 Limit force in shear.
FLT
 Limit force in tension
KS
 Shear linear stiffness.
KSN
 Nonlinear stiffness in shear after over loaded FLS
KT
 Tension linear stiffness.
KTN
 Nonlinear stiffness in tension after over loaded FLT
Uls
 Limit deformation in shear for stop solution UCRIT
Ult
 Limit deformation in tension for stop solution UCRIT
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace